# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
del baby_names['Unnamed: 0']
del baby_names['Id']

baby_names.head()

KeyError: 'Unnamed: 0'

### Step 6. Is there more male or female names in the dataset?

In [13]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [16]:
names = baby_names.groupby('Name').sum()
names.head()

                Id    Year  Count
Name
Aaban      7733803    4027     12
Aadan      7158065    8039     23
Aadarsh    1728031    2009      5
Aaden    555052225  393963   3426
Aadhav      709607    2014      6

### Step 8. How many different names exist in the dataset?

In [17]:
names.shape[0]

17632

### Step 9. What is the name with most occurrences?

In [23]:
names = names.sort_values(by = 'Count', ascending= False)
names.head(1)

               Id     Year   Count
Name
Jacob  1665681356  1141099  242874

### Step 10. How many different names have the least occurrences?

In [24]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [26]:
names[names.Count == names.Count.median()]

                Id   Year  Count
Name
Zuleima    3521373  14050     49
Vita      10241632  14075     49
Aziah     29825407  16073     49
Kaedence  34430468  18088     49
Antonina  27672250  18081     49
...            ...    ...    ...
Mckynzie  30075282  14068     49
Yoni       6439154  16060     49
Hareem    16374682  14090     49
Jkwon     20323939  14028     49
Nazier    31970176  16061     49

[66 rows x 3 columns]

### Step 12. What is the standard deviation of names?

In [27]:
names.Count.std()

11006.0694678915

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [28]:
names.describe()

                 Id          Year          Count
count  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.158117e+05    2008.932169
std    3.504513e+08  2.451618e+05   11006.069468
min    8.606500e+04  2.004000e+03       5.000000
25%    4.918375e+06  4.017000e+03      11.000000
50%    1.963463e+07  1.606100e+04      49.000000
75%    1.071826e+08  7.846425e+04     337.000000
max    3.223036e+09  2.233993e+06  242874.000000